{
  "items": [
    {
      "row": "0",
      "date": "Feb 18, 2022",
      "title": "GPI Awards",
      "subtitle": "Best Podcast Poker in the Ears (James Hartigan and Joseph Stapleton for PokerStars)",
      "url": "https://www.youtube.com/watch?v=E4bYuqnDXVE?autoplay=1&start=5500&end=5620",
      "image": "2022_PITEGPIAward.jpg",
      "excerpt": "Congratulations to everyone of the Poker in The Ears crew! So very well deserved!"
    },
    {
      "row": "1",
      "date": "Feb 1, 2022",
      "title": "Thinking Poker",
      "subtitle": "Episode #371: Joe Stapleton",
      "url": "http://www.thinkingpoker.net/2022/02/episode-371-joe-stapleton/",
      "image": "2-1-22_ThinkingPokerEpisode371.png",
      "excerpt": "Legendary commentator Joe Stapleton joins Andrew and Carlos to talk about comedy, stirring the pot on Twitter, the challenges of color commentary for online events, poker NFTs, and more."
    },
    {
      "row": "2",
      "date": "Oct 7, 2021",
      "title": "Mashable",
      "subtitle": "Meet the poker consultant ready to fix everything wrong with movie poker - Supporting Players",
      "url": "https://mashable.com/video/poker-consultant-the-card-counter-oscar-isaac",
      "image": "mashable_Oct72021.png",
      "excerpt": "Poker consultant Joe Stapleton was tasked with overseeing all of Oscar Isaac's poker scenes in the new film The Card Counter — and it's all the better for it."
    },
    {
      "row": "3",
      "date": "Dec 16, 2021",
      "title": "SlashFilm",
      "subtitle": "How A Professional Gambling Consultant Helped Up The Ante On The Card Counter",
      "url": "https://www.slashfilm.com/600815/how-a-professional-gambling-consultant-helped-up-the-ante-on-the-card-counter",
      "image": "slashfilms-thecardcounter.png",
      "excerpt": "Paul Schrader's latest movie, 'The Card Counter,' focuses on William Tell (Oscar Isaac), a man who has done unforgivable things and has found comfort in, and gotten very good at, playing poker. The film is a character piece, an exploration of how some monsters are made — in Tell's case he became one when he was in the military at Abu Ghraib — and how one man creates a life rife with rituals and routine to cope with what he's done."
    },
    {
      "row": "4",
      "date": "Spt 11, 2021",
      "title": "Counting on Joe",
      "subtitle": "Stapes discusses role as Poker Consultant for major motion picture ‘The Card Counter’",
      "url": "https://www.pokerstarsblog.com/en/news/counting-on-joe-stapes-discusses-role-as-poker-consultant-for-major-motion-picture-the-card-counter/74352/",
      "image": "pokerstars-blog-banner-card-counter.png",
      "excerpt": "Written and directed by Paul Schrader of Taxi Driver and Raging Bull fame (highlighting a long and impressive career résumé), the film stars Oscar Isaac, Tiffany Haddish, Tye Sheridan, and Willem Dafoe with Martin Scorsese an executive producer. The film had its world premiere earlier this month at the Venice International Film Festival, with its official release coming last week on Sept. 10. Early reviews have been uniformly excellent, with some already predicting multiple Academy Award nominations when they are announced early next year."
    },
    {
      "row": "5",
      "date": "Sep 10, 2021",
      "title": "USPoker.com",
      "subtitle": "Behind the Scenes: Joe Stapleton Helped Bring Poker Realism To New ‘Card Counter’ Film",
      "url": "https://www.uspoker.com/blog/behind-the-scenes-joe-stapleton-helped-bring-poker-realism-to-new-card-counter-film/36092/",
      "image": "uspokercom-joe-stapleton-card-counter-paul-schrader-movie-film.jpg",
      "excerpt": "Most poker fans have had the experience. A poker-related film or television show features action that really doesn’t play out as it would in the real world. Joe Stapleton knows the feeling. The longtime poker player, commentator, and comedian hopes his role as a poker consultant on the new film The Card Counter helped add more realism to the story. Hopefully, the film won’t leave poker players rolling their eyes."
    },
    {
      "row": "6",
      "date": "Aug 25, 2021",
      "title": "Poker.org",
      "subtitle": "Charity Series of Poker hosting online poker tournament for St. Jude on August 28",
      "url": "https://www.poker.org/charity-series-of-poker-hosting-online-poker-tournament-for-st-jude-on-august-28/",
      "image": "pokerorg-charity-series.png",
      "excerpt": "The Charity Series of Poker is a non-profit organization that organizes and promotes charity poker tournaments to raise money and awareness for a variety of worthy charities. Since it was founded in 2014, the CSoP has hosted 32 events to raise funds for 17 different charities. On Saturday, August 28, Charity Series of Poker will be putting on a virtual event to benefit the St. Jude Children’s Research Hospital."
    },
    {
      "row": "7",
      "date": "Aug 21, 2021",
      "title": "Pokernews.com",
      "subtitle": "Joe Stapleton Returns to Stand-Up Comedy Scene for First Time Since COVID-19",
      "url": "https://www.pokernews.com/news/2021/08/joe-stapleton-comedy-covid19-39670.htm",
      "image": "pokernews-aug212021.jpg",
      "excerpt": "Poker commentator and comedian Joe Stapleton went 18 months without performing his stand-up routine due to COVID-19. But the jokester will get back on the grind August 27 at the Fourth Wall Cafe in Los Angeles, the first of many shows on the horizon for one of poker's goofiest characters."
    }
  ]
}
