{
    "items": [
      {
        "row": "0",
        "date": "July 6, 2022",
        "Title": "British Comedy Guide",
        "subtitle": "Shuffling the Pack",
        "url": "https://www.comedy.co.uk/features/shuffling-the-pack",
        "image": "7-6-22 Shuffling the Pack article.jpg",
        "excerpt": "One thing comedians have to get used to when they go full-time is suddenly finding a lot more of it on their hands. Time, that is. Once they'd do a nine to five, daydreaming of material while staring at spreadsheets, then rush to gigs straight afterwards. Now you get up, stare at a blank Word document or scriptwriting app, daydream about anything but jokes then probably give up and play online poker instead. Which does then give you something to write about."
      },
      {
        "row": "1",
        "date": "June 3, 2022",
        "Title": "RunBoxBreaks",
        "subtitle": "2021 NFL PRIZM HOBBY RELEASE DAY!",
        "url": "https://www.twitch.tv/videos/1493660491",
        "image": "6-3-22 RunBoxBreaks.png",
        "excerpt": "Joe joins the stream to break some boxes and find some hits."
      },
      {
        "row": "2",
        "date": "May 11, 2022",
        "Title": "Paul Vato Presents",
        "subtitle": "Poker Commentator, Comedian & Podcaster Accidentally Reveals His Secret Addiction!",
        "url": "https://www.youtube.com/watch?v=kDwOfynJnps",
        "image": "7-6-22 Shuffling the Pack article.jpg",
        "excerpt": "Joe joins Paul to talk about some funny stories from their past as well as some latest news they have to share."
      },
      {
        "row": "3",
        "date": "March 12, 2022",
        "Title": "PokerNews",
        "subtitle": "Joe “Stapes” Stapleton on Losing GPA Trophy, Return of EPT Prague & More",
        "url": "https://www.pokernews.com/news/2022/03/joe-stapleton-ept-prague-40835.htm",
        "image": "3-12-22 Poker News.png",
        "excerpt": "The European Poker Tour (EPT) Prague is taking place right now, and someone who traveled across the pond to be there was Joe 'Stapes' Stapleton, who commentates EPT broadcasts alongside James Hartigan. The famed duo is actually fresh off winning a Global Poker Award for their podcast, Poker in the Ears, and are excited to be reunited in person in the booth."
      },
      {
        "row": "4",
        "date": "March 7, 2022",
        "Title": "Gamble Online",
        "subtitle": "Joe Stapleton and James Hartigan on the Return of EPT Prague",
        "url": "https://www.gambleonline.co/news/joe-stapleton-and-james-hartigan-on-the-return-of-ept-prague/",
        "image": "3-7-22 EPT Prague Gamble Online.png",
        "excerpt": "The return of the European Poker Tour this week is a huge boost to a poker landscape that has missed the live EPT festivals put on by the market leader in global terms, PokerStars."
      },
      {
        "row": "5",
        "date": "March 2, 2022",
        "Title": "PokerNews Podcast",
        "subtitle": "Joe Stapleton Talks EPT Prague, Tom Wheaton on BetMGM March Poker Mania",
        "url": "https://www.pokernews.com/podcast/pokernews-podcast/pokernews-podcast-joe-stapleton-tom-wheaton-40788.htm",
        "image": "3-2-22 Pokernews podcast.png",
        "excerpt": "In the latest PokerNews Podcast, Sarah Herring and Chad Holloway talk about Eugene Katchalov escaping Ukraine amid the Russian invasion, more drama from Hustler Casino Live, and welcome guest Tom Wheaton to come talk about the upcoming BetMGM March Poker Mania set to run March 20-27. They then recap the trio of ARIA High Roller tournaments, offer highlights from the 2022 Wynn Millions $1,600 Mystery Bounty, and chat with Joe 'Stapes' Stapleton about the return of the European Poker Tour (EPT) and upcoming EPT Prague."
      }
    ]
  }
